<template>
	<view class="container">
		<view class="header">
			用户协议
		</view>
		<text style="font-weight: bold;">
			重要提示
			您在勾选同意本协议之前，请务必认真阅读本协议，本协议及使用本产品过程中所涉及规定、条款、提示等均具有正式书面合同效力。请您务必审慎阅读、充分理解各个条款内容。除非您已阅读并接受本协议所有条款，否则您无权下载、安装或使用本软件及相关服务。您的下载、安装、使用、登录等行为即视为您已阅读并同意本协议的约束。
			如果您未满18周岁，请在法定监护人的陪同下阅读本协议。
		</text>
		<text>
			第一条 协议主体
			本协议是用户（以下可称为“您”）与西南交通大学之间关于下载、安装、使用、登录本软件，以及使用本服务所订立的协议。
			 
			第二条 协议内容和效力
			1. 当您勾选本协议，即表示您已经充分阅读、理解并接受本协议的全部约定。如您对本协议由任何疑问或对协议中的任一条款存有异议，请您立即停止进行下一步操作，不要继续申请入驻，并可以自行联系客服，届时我们也将不会向您提供后续服务。
			2. 本协议在您入驻平台并使用功能之期间持续有效。因平台提供的部分功能可能需要与您另行签订确认性或签约性文件（形式包括但不限于电子形式、书面形式、小程序内容展示以及其他平台采用的形式等）的，有效期以您与我们另行签订的文件为准，文件的内容我们会以合理途径（本文所述合理途径，即包括但不限于推送通知、弹窗提示、发送邮件/短信或者在小程序上发布的公告、寄送书面文件、面签及官方自媒体（包括但不限于微博、微信公众号）等途径，以下统称为“合理途径”）向您发起确认并签订。
			3. 本协议正文内容均为平台提供服务的基本约定，本协议的内容还包含有现行的平台规则已经发布或将来可能发布并采取合理途径通知或经由您确认的各类规则、操作流程、安装说明、行为规范、开通功能所需文件（包括但不限于确认性或签约性文件）。平台方有权以修改、更新等方式调整本协议和上述全部内容，届时将以合理途径通知您或向您发起确认、签约，其中通知生效的调整如您不愿接受，请您于收到通知起7个工作日内向平台客服反映并停止使用相应功能，否则我们将合理认为您已经同意我们的调整内容。
			 
			第三条 服务内容
			1.
			您使用西南交大的软件及服务，可以通过我们已授权的第三方下载等方式获取客户端应用程序或访问的相关网站。如您并非从我们或经我们授权的第三方获取本软件的，我们无法保证非官方版本的客户端能够正常使用，您因此遭受的损失与我公司无关。
			2. 我们有权对服务内容进行增减或调整。除非本协议另有其它明示规定，我们增加或强化目前的任何新功能，包括所推出的新产品，均受本使用协议之规范。
			3. 服务使用规范
			3.1 您在使用平台过程中，不得以任何方式利用本平台直接或间接从事违反中国法律、以及社会公德的行为，应当遵守尊重不同地区、地域的道德和风俗习惯，并且应避免因使用本品台而使本平台卷入政治和公共事件。
			3.2 您须严格依照《中华人民共和国消费者权益保护法》以及其他法规、部门规章和国家强制性标准规定的要求使用平台服务。如您存在违背本款约定的行为的，我们将有权采取自我救助的措施避免或减少遭受的损失。
			3.3 平台服务如果涉及到平台方、第三方的信息，所有的信息您须同意遵守《隐私政策》约定不得将平台方、第三方的信息使用在其他用途，并负起不低于保护自身利益的保护措施的相应责任。
			3.4 如果您选择平台服务的过程中享受到服务和便利时，对我们场馆或硬件仍有维护其不被恶意或人为损坏的义务。
			3.5 您承诺不对平台产品和服务从事以下行为：
			3.5.1 将有关干扰、破坏或限制任何计算机软件、硬件或通讯设备功能的软件病毒或其他计算机代码、档案和程序之资料，加以上载、张贴、发送电子邮件或以其他方式传送；
			3.5.2 干扰或破坏本服务或与本服务相连线之服务器和网络，或违反任何关于本服务连线网络之规定、程序、政策或规范；
			3.5.3 通过修改或伪造软件运行中的指令、数据，增加、删减、变动软件的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论这些行为是否为商业目的；
			3.5.4 通过非平台方开发、授权的第三方软件、插件、外挂、系统，登录或使用软件及服务，或制作、发布、传播上述工具；
			3.5.5 自行、授权他人或利用第三方软件对本软件及其组件、模块、数据等进行干扰。
			3.6 当您终止平台服务的使用，或停止接受平台服务的，我们将会冻结您于平台上的全部信息，并且只会保存一段时间（这段时间基于平台方的实际技术、客观原因等决定，由您自行联系平台方），请您务必及时做好数据信息的备份存储，如您未能及时作出处理，将也无法再检索、访问、获取、继续使用和找回，也无权要求平台方找回。

			第四条、服务费用
			4.1 您在使用平台的过程中，有部分服务、功能或者其他新增服务、功能采取收费制度，届时平台方会通过合理途径并以足够合理的期限提前通过法定程序通知您，确保您有充分的选择权利。为确保您的财产权益不受损害，请您务必以平台方指定的渠道公布的标准为准，任何非平台方的渠道均存在假冒风险。
			4.2 如果您与平台方存在需要结算的情形的，您应确保您的收款账户信息准确无误，平台方仅能根据接收到的账户信息进行形式核准，对于账户信息的实际真实性无法审核，您须自行承担收款账户真实性、准确性的法律责任。如您需要修改或者调整账户信息的，须自行联系平台客服并依照平台规则另行提供相关文件，否则平台方有权不予变更。
			 
			第五条、免责与有限责任
			5.1 平台提供的服务将按照“现状”和“可得到”的状态提供。我们将在现有技术的基础上尽最大努力提供相应的安全措施以保障服务安全和正常运行。但由于可能存在计算机病毒、网络通讯故障、系统维护等方面的因素以及可能存在的软硬件瑕疵、功能不足或任何需要改进事项等各类不可抗力事件（还包括但不限于Internet连接故障、手机或计算机系统故障、通讯故障、电力故障、电脑病毒、黑客入侵、罢工、劳动争议、暴乱、起义、骚乱、火灾、洪水、风暴、爆炸、战争），平台方在此明确声明，对上述原因造成的损失平台方将不对您承担责任。
			5.2 平台方保留变更、中断或终止某些服务的权利，对于因服务调整引起您数据损失等问题，除法律明确规定外，平台方将不承担责任。
			5.3 平台服务是一项内容复杂、技术要求高、数据庞大的智能软硬件系统，平台方会对因平台方的故意或重大过失造成您损失承担违约或赔偿责任，金额以平台方从您收取的费用为限。
			5.4 您同意，平台方主办活动中的免费服务或产品、赠送服务或产品、附赠服务或产品等，平台方享有最终解释权，并不对瑕疵或造成第三方损失承担相应责任，并有权根据平台现行规则取消违反活动目的或影响活动行为的用户资格，如您的违反或影响行为造成平台方损失的，我们有权追究赔偿。
			5.5 对于恶意进行注册，侵害平台经营的情况，平台方有权停止服务、封停账号并追究责任。
			5.6 您同意，平台方可对用户已经向平台提供的信息、资料进行保存，并进行合理的使用。
			 
			第六条、第三方程序或服务
			6.1平台功能、服务中可能存在接入、使用第三方提供的程序或服务（以下简称该等服务），该等服务是为了向您提供便利而设置，有部分为我们已经获得合法授权，有部分可能需要您的授权，届时我们会向您获取权限，如您拒绝授权，我们将无法向您提供服务，因此导致责任和风险将由您自行承担。
			6.2 由于该等服务有第三方提供，在您使用该等服务时，应另行与第三方达成相应协议，平台方并无权在本协议中授予您使用该等服务的任何权利，也无权对该等服务提供任何形式保证。因您使用该等服务引发的任何纠纷，您可以直接与第三方协商。
			6.3 对于该等服务的途径提供，平台方有权根据实际需要或战略安排随时变更或者终止，我们无法保证永久地接入或使用该等服务。
			 
			第七条、服务中止或终止
			7.1 鉴于客户端及以移动客户端服务的特殊性，平台方有权对服务内容进行变更，也可能会中断、中止或终止全部或者任一部分的服务，包括免费服务和/或收费服务，并通过合理渠道以公示的形式通知您。
			7.2 您了解并同意，平台方可能定期或不定期地对提供网络服务的平台设备、设施和软硬件进行维护或检修，如因此类情况而造成收费服务在合理时间内中止，平台方无需承担责任，但应事先通过合理途径以公示的形式通告您。
			7.3 如存在下列违约情形之一，平台方可立即对用户中止或终止服务，并要求用户赔偿损失：
			7.3.1 用户违反平台规定信息的；
			7.3.2 用户使用收费服务时未按规定支付相应服务费；
			7.4 除您基于自身意思表示选择、申请的部分服务、功能外，您终止使用平台服务并注销账户的，本协议自动终止，我们将无需继续为您提供服务。一旦您终止本协议的，我们将视为您已经完成数据备份，我们将不再对其负责，由您自行承担相应风险及责任。
			7.5 您应理解并按本协议及平台规则等文件使用平台服务，如您严重违反的，我们将会选择终止本协议并不再向您提供服务。
			7.6 如因经营原因、不可抗力、业务性质转变等导致平台服务执行不能的，我们将会提前30日通过合理途径向您告知，期间我们将竭尽全力协助并维护您的重要权益，并在期限届满之日终止平台服务，本协议将自动失效。
			  
			第八条、争议解决与其他
			8.1 本协议之解释与适用，以及与本协议有关的争议，均应依照中华人民共和国法律，并以平台方注册所在地（按平台方营业执照为准）有管辖权的人民法院为第一审管辖法院。
			8.2 如本协议的任何条款被视作无效或无法执行，则上述条款可被分离，其余部份仍具法律效力。
			8.3 您可以在平台上查看本协议，我们鼓励您在每次使用平台服务时查阅我们的所有协议。

		</text>
	</view>
</template>
<script>

</script>
<style>
	.container {
		padding: 24rpx;
	}

	.header {
		font-size: 40rpx;
		font-weight: bold;
		text-align: center;
	}
</style>
