<template>
	<view class="container">
		<view class="header">
			隐私协议
		</view>
		<text>前述                                                                                  
			西南交通大学（以下统称为“我们”或者“西南交大”），深知您的信息对您而言的重要性，为满足您对我们的信任，我们将通过本政策向您详尽、真实地说明西南交大智慧场馆系统如何收集、存储、使用、保存、共享和保护您的信息，同时我们会明确您享有的权利。
			 
			【重要提醒】请您在使用我们提供的各项产品/服务前，仔细阅读并充分理解本《隐私协议》并作出相应选择。一旦您使用或继续使用我们的产品/服务时，即意味着您同意我们按照本隐私政策收集、存储、使用、保存、共享和保护您的相关信息。
			 
			如您对本隐私政策有任何疑问，请务必停止继续进行下一步操作，并通过我们的线上或电话客服与我们取得联系，我们将及时、详细地为您作出解答。
			 
			请您务必注意，您与我们之间，除我们向您提供优质、增效的服务外，根据法律规定以及您与我们之间的协议约定，您应保证您在使用我们平台服务中所提供的的一切数据均为真实、且经过合法途径获得，请您确认已经取得信息都是合法的授权。您清楚我们为服务机构，不具有监管机构（包括但不限于市场监督管理局、体育局、税务局等）的审批管控能力，一旦您在使用我们服务过程中提供此类信息的，我们将认为该类信息均为您有权处理，不存在任何违反法律、法规或侵犯任何第三方合法权利的事由/瑕疵/场景。
			  
			为保证您能进一步详细且真实地了解我们的隐私约定，请您仔细阅读隐私政策详细条款：
			 
			一、我们可能收集的用户信息
			我们提供服务时，可能会收集、储存和使用下列与您有关的信息。如果您不提供相关信息，可能无法注册成为我们的用户或无法享受我们提供的某些服务，或者无法达到相关服务拟达到的效果。
			1、您提供的信息
			•  您在注册账户或使用我们的服务时，向我们提供的相关个人信息，例如电话号码、身份证号码等。
			• 您通过我们的服务向其他方提供的共享信息，以及您使用我们的服务时所储存的信息。
			2、其他方分享的您的信息
			其他方使用我们的服务时所提供有关您的共享信息。
			3、我们获取的您的信息。 您使用服务时我们可能收集如下信息：
			• 日志信息，指您使用我们的服务时，系统可能自动采集的技术信息，包括：设备或软件信息，例如您的移动设备、网页浏览器或用于接入我们服务的其他程序所提供的配置信息、您的IP地址和移动设备所用的版本和设备识别码；以及您在使用我们服务时要求提供的其他信息和内容详情。
			• 位置信息，指您开启设备定位功能并使用我们基于位置提供的相关服务时，收集的有关您位置的信息。您可以通过关闭定位功能，停止对您的地理位置信息的收集。
			4、合作机构提供的您的信息
			我们会通过第三方机构（包括但不限于通过合法的征信机构个人信用信息基础数据库及外部数据）查询您的信用报告中的身份、联系方式等个人身份、电信信息、地址、位置等基本 信息和关联人信息等。

			二、我们可能如何使用用户信息
			1、在我们提供服务时，用于身份验证、客户服务、安全防范、诈骗监测、存档和备份用途，确保我们向您提供的产品和服务的安全性；
			2、帮助我们设计新服务，改善我们现有服务；
			3、使我们更加了解您如何接入和使用我们的服务，从而针对性地回应您的个性化需求；
			4、软件认证或管理软件升级；
			5、让您参与有关我们产品和服务的调查。

			三、我们如何保护用户信息
			我们使用各种安全技术和程序，以防信息的丢失、不当使用、未经授权阅览或披露。但请您理解，由于技术的限制以及可能存在的各种恶意手段，在互联网行业，即便竭尽所能加强安全措施，也不可能始终保证信息百分之百的安全。您需要了解，您接入我们的服务所用的系统和通讯网络，有可能因我们可控范围外的因素而出现问题。
			  
			四、通知与修订
			为给您提供更好的服务，我们的业务将不时变化，本隐私政策也将随之调整。未经您明确同意，我们不会削减您依据本隐私政策所应享有的权利。我们会通过在我们网站、移动端、其他客户端上发出更新版本或以其他方式提醒您相关内容的更新，也请您访问我们以便及时了解最新的隐私政策。在前述情况下，若您继续使用我们的服务，即表示同意接受修订后的本政策并受之约束。

			五、如何联系我们
			如果您对于我们的信息处理行为存在任何投诉举报需求，您可以通过线上或者电话的方式与我们联系并作充分描述，我们详尽的答复您的请求并尽力解决。如果您对我们的回复不满意，特别是认为我们的信息处理行为损害了您的合法权益，您还可以通过向我们住所地有管辖权的法院提起诉讼。</text>
	</view>
</template>
<script>

</script>
<style>
	.container {
		padding: 24rpx;
	}

	.header {
		font-size: 40rpx;
		font-weight: bold;
		text-align: center;
	}
</style>
